import React from "react";
import CustomAccordian from "../ui/CustomAccordian";

const QA = () => {
  return (
    <section className="min-h-fit min-w-full py-10">
      <h4 className="min-w-full border-b-[3px] border-white text-[2rem] font-bold pb-5">سوالات متداول</h4>
      <CustomAccordian
        description="Game-Hub انواع محصولات را از جمله بازی‌ها، کامپیوتر، لپتاپ، لوازم فناوری و فیلم‌ها در یک مکان مناسب و جامع ارائه می‌دهد. همچنین ما مشاوره و توصیه‌هایی را ارائه می‌دهیم تا به شما در انتخاب بهترین محصولات برای نیازهای بازی و فناوری کمک کنیم"
        title="چگونگی تفاوت فروشگاه آنلاین Game-Hub با سایر فروشگاه‌های آنلاین فناوری و بازی؟"
      />
      <CustomAccordian
        description="بدون شک. ما تنها محصولاتمان را از تامین کنندگان قابل اعتماد و موثوق تهیه می‌کنیم تا همه چیزی که فروخته می‌شود با استانداردهای کیفی بالا سازگار باشد. علاوه بر این، ما گارانتی بازگشت وجه ارائه می‌دهیم تا در هنگام خرید شما احساس اطمینان کنید."
        title="آیا می‌توانم به کیفیت محصولاتی که در Game-Hub فروخته می‌شوند اعتماد کنم؟"
      />
      <CustomAccordian
        description="در Game-Hub، ما امنیت و حریم خصوصی داده‌ها را جدی می‌گیریم. وبسایت ما با رمزنگاری و اقدامات امنیتی پیشرفته مجهز شده است تا اطلاعات شخصی شما را حفاظت کند. همچنین، ما با رعایت سیاست‌های حریم خصوصی سختگیرانه اطمینان حاصل می‌کنیم که اطلاعات شما همیشه در امان باشد.
        "
        title="چگونه می‌توانم اطمینان حاصل کنم که اطلاعات شخصی من در هنگام خرید از Game-Hub امن است؟"
      />{" "}
      <CustomAccordian
        description=" بله، ما از مشتریان وفادار خود لذت می‌بریم! چشم اندازتان را برای تخفیف‌ها، پیشنهادهای ویژه‌ای که تنها برای اعضای برنامه وفاداری ما در دسترس است، شارپ کنید. امروز به عضویت دهید تا از مزایا لذت ببرید."
        title=" آیا برای مشتریان وفادار خود تخفیف‌ها یا پیشنهادهای ویژه‌ای ارائه می‌دهید؟"
      />{" "}
      <CustomAccordian
        description=" تیم خدمات مشتری ما ۲۴/۷ برای کمک به شما در هر سوال یا نگرانی‌ای که داشته باشید در دسترس است. از سفارش، اطلاعات محصول یا پشتیبانی فنی است، هر قدمی را که برمی‌دارید، ما در کنار شما هستیم."
        title=" در صورتی که مشکلی با سفارش خود داشته باشم یا پس از خرید نیاز به کمک داشته باشم، چه کار باید انجام دهم؟"
      />{" "}
      <CustomAccordian
        description="بله، ما می‌فهمیم که گاهی اوقات اتفاق می‌افتد که چیزها به گونه‌ای که برنامه ریزی شده برنمی‌آیند. به همین دلیل قوانین بازگشت ما بدون مشکل و ارائه شده است که به شما امکان می‌دهد هر محصول را در یک مدت مشخص برگردانده و دریافت یا تعویض آن را کامل به شما بدهید. رضایت شما برای ما اولویت است."
        title=" آیا می‌توانم یک محصول را برگردانم اگر تصمیمم را تغییر دهم یا اگر با انتظاراتم مطابقت نداشته باشد؟"
      />
    </section>
  );
};

export default QA;
