import { getAllRawProducts } from "@/services/productServices";
import { productInterface } from "@/types/product";
import HeroSection from "@/components/landing-page/HeroSection";
import ContentTemplate from "@/components/landing-page/ContentTemplate";
import GamePic from "@/assets/man-neon-suit.jpg";
import PcPic from "@/assets/pc.jpg";
import attpIC from "@/assets/attachments.jpg";
import filmPic from "@/assets/films.jpg";
export default async function Home() {
  const {
    data: {
      data: { products },
    },
  }: {
    data: {
      data: { products: productInterface[] };
    };
  } = await getAllRawProducts();

  return (
    <main className="flex min-w-full min-h-screen flex-col items-start justify-start px-2 py-10 md:p-24 gap-10 relative ">
      <HeroSection products={products} />
      <div className="min-w-full min-h-fit flex flex-col items-center justify-center gap-5 relative z-20 bg-inherit mt-10 md:mt-32">
        <ContentTemplate
          classname=" flex-wrap "
          img={GamePic.src}
          title="RPG‌های جذاب، مجموعه ما همه چیز را دارد"
        >
          خود را در دنیایی از بازی‌های هیجان‌انگیز، فناوری پیشرفته و فیلم‌های
          بلوکباستر غرق کنید، همه در یک مکان، Game-Hub. در Game-Hub، به ارائه
          بهترین تجربه بازی و سرگرمی ممکن متعهد هستیم. در گیم-هاب، مجموعه‌ای
          گوناگون از آخرین و بهترین بازی‌ها برای تمام پلتفرم‌ها ارائه می‌دهیم.
          برای هر دستگاه کنسول یا علاقه‌مندان به کامپیوتر، ما چیزی برای همه
          داریم. از ماجراجویی‌های پر اکشن تا RPG‌های جذاب.
        </ContentTemplate>{" "}
        <ContentTemplate
          classname=" flex-wrap md:flex-row-reverse"
          img={PcPic.src}
          title="تجربه بازی خود را با کامپیوترها و لپ‌تاپ‌های برتر ما بهبود دهید."
        >
          "تجربه بازی خود را با کامپیوترها و لپ‌تاپ‌های برتر ما بهبود دهید. از
          سیستم‌های بازی با عملکرد بالا تا لپ‌تاپ‌های زیبا و قابل حمل، ما دستگاه
          مناسب برای نیازهای شما داریم. با فناوری برش‌زنده گیم-هاب، همیشه جلوتر
          از دیگران باشید. تجربه قدرت کامپیوترها و لپتاپ‌های برتر را بچشید که
          برای بازی و تولید محصول طراحی شده‌اند. بدون توجه به اینکه شما یک کاربر
          عادی یا یک گیمر حرفه‌ای هستید، انتخاب دقیق ما به شما امکان می‌دهد تا
          دستگاه مناسب برای نیازهای خود پیدا کنید. با پردازنده‌های پیشرفته،
          صفحه‌نمایش‌های با وضوح بالا و کارت‌های گرافیک سریع، کامپیوترها و
          لپتاپ‌های ما عملکرد و غوطه‌وری بی‌نظیری را ارائه می‌دهند. با Game-Hub
          تجربه بازی خود را ارتقا دهید.
        </ContentTemplate>{" "}
        <ContentTemplate
          classname=" flex-wrap   "
          img={attpIC.src}
          title="لوازم جانبی فناوری متنوع ما را برای بهبود تجربه بازی خود به سرعت اضافه
          کنید. جذاب، مجموعه ما همه چیز را دارد"
        >
          لوازم جانبی فناوری متنوع ما را برای بهبود تجربه بازی خود به سرعت اضافه
          کنید. از موش و صفحه کلید بازی گرفته تا هدست‌های VR و تجهیزات
          استریمینگ، همه چیزی که برای بهبود تجربه بازی شما نیاز دارید، در
          گیم-هاب موجود است.تجربه بازی و تکنولوژی خود را با مجموعه گسترده‌ای از
          لوازم جانبی پیشرفته بهبود دهید. از کارت‌های گرافیک با عملکرد بالا و
          هدست‌های واقعیت مجازی غوطه‌ورساز تا صفحه‌کلیدهای بازی ارگونومیک و
          ماوس‌های دقیق بازی، همه چیزی که برای بهینه‌سازی تجربه بازی خود نیاز
          دارید را در اختیار داریم. تیم متخصصان ما هر لوازم جانبی را به دقت
          انتخاب می‌کند تا کیفیت برتر و سازگاری با دستگاه‌های شما را تضمین کند.
          تجربه بازی خود را با لوازم جانبی فناوری برتر Game-Hub ارتقا دهید.
        </ContentTemplate>{" "}
        <ContentTemplate
          classname=" flex-wrap md:flex-row-reverse "
          img={filmPic.src}
          title="علاوه بر مجموعه گسترده‌ای از بازی و فناوری، گیم-هاب همچنین مجموعه‌ای
          متنوع از آخرین فیلم‌ها و سرگرمی‌ها را ارائه می‌دهد. "
        >
          علاوه بر مجموعه گسترده‌ای از بازی و فناوری، گیم-هاب همچنین مجموعه‌ای
          متنوع از آخرین فیلم‌ها و سرگرمی‌ها را ارائه می‌دهد. برای دوستداران
          سینما یا کسانی که به دنبال تماشای چیز جدید هستند، مجموعه ما چیزی برای
          همه دارد. در گیم-هاب، به راحتی بنشینید، استراحت کنید و از آخرین
          فیلم‌های پرطرفدار لذت ببرید . در دنیایی از شگفتی‌های سینمایی با مجموعه
          گسترده‌ای از فیلم‌ها غوطه‌ور شوید. از فیلم‌های اکشن پرطرفدار تا
          درام‌های دلنشین، انتخاب ما به تمام سلیقه‌ها و ژانرها پاسخ می‌دهد. بدون
          توجه به اینکه شما به دنبال یک ماجرای پرادرنالین هستید یا به فکر یک
          فیلم مستقل و الهام‌بخش هستید، Game-Hub شما را پوشش می‌دهد. با
          گزینه‌های استریم با کیفیت عالی و خدمات اجاره مناسب، می‌توانید شب‌های
          فراموش‌نشدنی فیلم را از راحتی خانه خود لذت ببرید. در خلق جادوی داستان
          با مجموعه فیلمی Game-Hub غوطه‌ور شوید.
        </ContentTemplate>
      </div>
    </main>
  );
}
